{
  "title": "Um overview sobre o filme",
  "description": "Drácula, baseado no romance Drácula de Bram Stoker, foi adaptado para o cinema várias vezes ao longo dos anos, com diferentes diretores e versões. Uma das versões mais famosas é o filme Dracula de 1992, dirigido por Francis Ford Coppola. Neste filme, o papel de Drácula é interpretado por Gary Oldman, que oferece uma atuação icônica como o vampiro. O elenco também inclui Winona Ryder como Mina Harker, Anthony Hopkins como Professor Abraham Van Helsing e Keanu Reeves como Jonathan Harker. O filme se destaca por sua atmosfera gótica, figurinos impressionantes e efeitos visuais inovadores para a época. Francis Ford Coppola é um renomado diretor de cinema, conhecido por seus filmes notáveis, como O Poderoso Chefão e Apocalypse Now. Em Dracula, Coppola trouxe seu estilo distintivo para a adaptação do clássico de Stoker, combinando elementos de horror, romance e drama. O filme de Coppola ganhou elogios por sua fidelidade à fonte original e sua capacidade de criar uma atmosfera sombria e sedutora. A direção de arte, a trilha sonora e as performances dos atores contribuíram para tornar esta versão de Drácula um filme memorável na história do cinema de terror e uma interpretação única do mito do vampiro.",
  "direcao": "Direção: Francis Ford Coppola",
  "roteiro": "Roteiro: James V. Hart",
  "elenco": "Elenco: Gary Oldman, Keanu Reeves, Winona Ryder, Anthony Hopkins, Richard E. Grant, entre outros",
  "ano": "1992",
  "figurino": "O figurino do filme Drácula de Bram Stoker é conhecido por sua riqueza e detalhes. O filme, dirigido por Francis Ford Coppola e lançado em 1992, apresenta figurinos de época impressionantes que refletem o período vitoriano. Os trajes incluem roupas elegantes da aristocracia, vestidos luxuosos e capas icônicas, com destaque para o visual extravagante de Drácula, interpretado por Gary Oldman, que varia de era em era, desde o medieval até o vitoriano. O figurino contribui para a atmosfera gótica e sombria do filme.",
  "contato": "Caro amante da literatura gótica e fã do Drácula de Bram Stoker, Estamos emocionados por você estar interessado em entrar em contato conosco. Se você tem alguma pergunta, sugestão, ou simplesmente deseja compartilhar sua paixão pelo mundo sombrio de Drácula, estamos aqui para ouvir você! Para facilitar a comunicação, criamos um formulário de contato fácil de usar. Basta preencher as informações necessárias abaixo, escrever sua mensagem e clicar em enviar. Prometemos responder o mais rápido possível. Este componente foi desenvolvido usando os Reactive Forms do Angular - Neste código você irá encontrar o uso de FormBuilder, FormGroup e FormControl, bem como as validações e validações personalizadas de campos - as mensagens de erro ainda não estão devidamente estilizadas. =)",
  "nomeDracula": "Conde Drácula",
  "nomeMina": "Mina Murray",
  "nomeLucy": "Lucy Westenra",
  "nomeHelsing": "Abraham Van Helsing",
  "nomeJonathan": "Jonathan Harker",
  "nomeArthur": "Lorde Arthur Holmwood",
  "nomeCary": "Dr. John Seward",
  "descricaoPersonagens": "O filme Drácula de Bram Stoker (1992), dirigido por Francis Ford Coppola, é uma adaptação da obra homônima de Bram Stoker. O filme conta a história do conde Drácula, um vampiro que se apaixona por Mina Murray, noiva do jovem advogado Jonathan Harker.",
  "descricaoDracula": "É um vampiro milenar que está apaixonado por Mina Murray. Ele é um ser poderoso e cruel, que está disposto a tudo para ter Mina. Drácula é capaz de se transformar em uma névoa, um lobo e um morcego. Ele também tem a capacidade de hipnotizar suas vítimas.",
  "descricaoMina": "Mina Murray é uma jovem inglesa que está noiva de Jonathan Harker. Ela é uma mulher inteligente e independente, que se torna uma peça-chave na batalha contra Drácula. Mina é capaz de se comunicar telepaticamente com Drácula, o que permite a ela e aos seus amigos rastreá-lo.",
  "descricaoJonathan": "Jonathan Harker é um jovem advogado inglês que é enviado para a Transilvânia para negociar a compra de um castelo para o seu cliente, o conde Drácula. Ao chegar ao castelo, Harker é capturado e aprisionado por Drácula, que se revela um vampiro. Harker consegue escapar do castelo e retornar para Londres, onde conta a sua história para sua noiva, Mina Murray.",
  "descricaoLucy": "Lucy Westenra é a melhor amiga de Mina Murray. Ela é uma jovem bela e rica, que se torna uma vítima de Drácula. Lucy é transformada em uma vampira, e seus amigos são forçados a matá-la para que ela não continue a causar danos.",
  "descricaoHelsing": "Abraham Van Helsing é um professor holandês que é especialista em vampiros. Ele é contratado por Jonathan Harker para ajudar a derrotar Drácula. Van Helsing é um homem sábio e experiente, que é capaz de usar seus conhecimentos para lutar contra os vampiros.",
  "descricaoArthur": "Lorde Arthur Holmwood, o noivo de Lucy Westenra",
  "descricaoCary": "Dr. John Seward, um médico que é o responsável pelo tratamento de R. M. Renfield.",
  "tituloFilmes": "Buscar Poster de Filmes",
  "textoFilme": "Nesta página você poderá pesquisar o filme por nome, retornar o nome e a imagem do poster do filme. Neste componente estamos consumindo a API do TMDb passando parâmetros nas requisições HTTP - HttpParams. Digite o nome que deseja pesquisar e a solicitação irá retornar o poster e o nome do filme. Enjoy!"

}
